server/app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
    def index
        render json: Record.all