server/app/controllers/sessions_controller.rb

    def shopping_cart
        if @current_user
            array = []
            price = 0
            @shopping_cart.each do |t|
                if t.record_id.present?
---
SELECT "records".* FROM "records"