server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @current_user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("username", "email", "bio", "country", "instagram_handle", "avatar", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
      user = User.create(user_params)